app/views/messages/index.html.erb


<%current_user.messages.each do |message|%>
---
SELECT "messages".* FROM "messages"