app/views/lands/index.html.erb

    <%= text_field_tag :query, params[:query] %>
    <%= select_tag 'category', options_for_select(Land.all.map{|el| [el.tenduan, el.id]}), class: 'form-control'%>
---
SELECT "lands".* FROM "lands" WHERE (to_tsvector('english', 'TenDuAn') @@ 'gold land bình thạnh' or to_tsvector('english','TenDuAn') @@ 'gold land bình thạnh') ORDER BY        ts_rank(to_tsvector("TenDuAn"), plainto_tsquery('gold land bình thạnh'))