app/controllers/conversations_controller.rb

def index
if(params[:user_id])
@conversations = Conversation.participating(current_user).order('updated_at DESC')
else
@conversations=Conversation.all
---
SELECT "conversations".* FROM "conversations"