app/controllers/lands_controller.rb

SELECT "lands".* FROM "lands" WHERE (to_tsvector('english', lower(TenDuAn)) @@ '222' or to_tsvector('english',lower(TENDUAN)) @@ '222') ORDER BY        ts_rank(to_tsvector(lower(TenDuAn)), plainto_tsquery('222'))
---
  def index
    @lands=Land.all

SELECT  "lands".* FROM "lands" WHERE "lands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @land= Land.find(params[:id])

SELECT  "lands".* FROM "lands" WHERE "lands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @land= Land.find(params[:id])

SELECT  "lands".* FROM "lands" WHERE "lands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "lands" SET "user_id" = $1, "tien" = $2, "updated_at" = $3 WHERE "lands"."id" = $4  [["user_id", 10], ["tien", "666"], ["updated_at", "2017-12-12 08:57:55.209382"], ["id", 11]]
---
  def update
    @land= Land.find(params[:id])
    if @land.update(params.require(:land).permit(:tien))

INSERT INTO "lands" ("TenDuAn", "TenChuDauTu", "Phuong", "ThanhPho", "Tinh", "Dientich", "DiaChi", "created_at", "updated_at", "user_id", "DateStart", "DateEnd") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
@land=Land.new(land_params)
if @land.save