app/controllers/line_items_controller.rb

SELECT  "lands".* FROM "lands" WHERE "lands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-12-20 11:16:29.829389"], ["updated_at", "2017-12-20 11:16:29.829389"]]
INSERT INTO "line_items" ("unit_price", "quantity", "created_at", "updated_at", "land_id", "cart_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["unit_price", "222.0"], ["quantity", 1], ["created_at", "2017-12-20 12:16:58.075711"], ["updated_at", "2017-12-20 12:16:58.075711"], ["land_id", 10], ["cart_id", 2]]
---
  def create
  #  byebug
    @land = Land.find(params[:land_id])
    @line_item = LineItem.create!(:cart_id => current_cart.id, :land_id => @land.id, :quantity => 1, :unit_price => @land.tien)