app/controllers/payments_controller.rb

    def create
      @payment = current_cart.build_payment(payment_params)
      @payment.ip_address = request.remote_ip
      #byebug
      if @payment.save!
        if @payment.purchase
          UserMailer.succeed_email(current_user).deliver_now
          flash[:success]="Giao dich thanh cong"
          redirect_to payment_path(@payment)
        else
          flash[:error]="Giao dich that bai"
          redirect_to lands_path
        end
      else
        logger.debug @payment.errors.full_messages.join(", ")
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-12-19 12:27:23.177219"], ["updated_at", "2017-12-19 12:27:23.177219"]]
INSERT INTO "payments" ("created_at", "updated_at", "firstname", "lastname", "cart_id", "ip_address") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2017-12-20 04:43:08.322566"], ["updated_at", "2017-12-20 04:43:08.322566"], ["firstname", "van"], ["lastname", "nguyen"], ["cart_id", 16], ["ip_address", "127.0.0.1"]]
UPDATE "carts" SET "purchased_at" = $1, "updated_at" = $2 WHERE "carts"."id" = $3  [["purchased_at", "2017-12-20 15:00:38.832540"], ["updated_at", "2017-12-20 15:00:38.834892"], ["id", 1]]
SELECT  "payments".* FROM "payments" WHERE "payments"."cart_id" = $1 LIMIT $2  [["cart_id", 9], ["LIMIT", 1]]