app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @user= User.find(params[:id])

INSERT INTO "users" ("name", "email", "address", "number", "created_at", "updated_at", "password_digest", "country") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    #byebug
    if @user.save